dict = {
    "ID" : "19",
    "Прізвище" : "Слюсар",
    "Ім'я" : "Софія",
    "Група" : "ІПЗс-23-2",
    "Курс" : "1",
    "Книги (борг)" : ["Безпека життєдіяльності", "Бояриня", "Івасик-Телесик", "Колобок"],
    "Книги (статистика)" : ["Українське ділове мовлення", "Кобзар", "Витончене мистецтво забивати на все", "Думай і багатій"]}

print("Карта читача:")
print("ID -",dict["ID"])
print("Прізвище -",dict["Прізвище"])
print("Ім'я -",dict["Ім'я"])
print("Група - ",dict["Група"])
print("Курс -",dict["Курс"])
print("Борг -",dict["Книги (борг)"])
print("Статистика -",dict["Книги (статистика)"])

while True:
    print()
    print("Меню:")
    print("0 - Вихід")
    print("1 - Карта читача")
    print("2 - Взяти книгу")
    print("3 - Повернути книгу")

    choice = input("Виберіть опцію: ")

    if choice == "0":
        break
    elif choice == "1":
        print()
        print("Карта читача:")
        for key, value in dict.items():
            print(f"{key} : {value}")

    elif choice == "2":
        book = input("Введіть назву книги, яку хочете взяти: ")
        dict["Книги (борг)"].append(book)
        print(f"Книга '{book}' успішна додана до списку борг.")
    elif choice == "3":
        if len(dict["Книги (борг)"]) == 0:
            print("У вас немає книг у боргу.")
        else:
            print("Список книг у боргу: ")
            for x in dict["Книги (борг)"]:
                print(x)
            book = input("Введіть назву книги, яку хочете повернути: ")
            if book in dict["Книги (борг)"]:
                dict["Книги (борг)"].remove(book)
                dict["Книги (статистика)"].append(book)
                print(f"Книга '{book}' успішно повернута.")
            else:
                print(f"Книгb '{book}' немає у списку борг.")
                      
print("Програма завершила роботу.")